import {
  Paper,
  Stack,
  FormControl,
  // Select, MenuItem
} from "@mui/material";
import { Select } from "antd";
import "./sort.css";

export type SortEvent =
  | React.ChangeEvent<
      Omit<HTMLInputElement, "value"> & {
        value: string;
      },
      Element
    >
  | (Event & {
      target: {
        value: string;
        name: string;
      };
    });

export default function Sort({
  layout,
  q,
  handleSearch,
  handleByList,
  handleByGrid,
  sortColumn,
  sortDirection,
  handleSortCol,
  handleSortDir,
}: {
  layout: "grid" | "list";
  q: string;
  handleSearch: (
    e: React.ChangeEvent<HTMLInputElement | HTMLTextAreaElement, Element>,
  ) => void;
  handleByList: () => void;
  handleByGrid: () => void;
  sortColumn: string;
  sortDirection: string;
  handleSortCol: (value: string) => void;
  handleSortDir: (value: string) => void;
}) {
  // const handleSort = (
  //   e:
  //     | React.ChangeEvent<
  //         Omit<HTMLInputElement, "value"> & {
  //           value: string;
  //         },
  //         Element
  //       >
  //     | (Event & {
  //         target: {
  //           value: string;
  //           name: string;
  //         };
  //       }),
  // ) => {
  //   const [column, direction] = e.target.value.split(" ");
  //   setValue(e.target.value);
  //   handleSortCol(column);
  //   handleSortDir(direction);
  // };

  const handleSort = (value: string) => {
    const [column, direction] = value.split(" ");
    handleSortCol(column);
    handleSortDir(direction);
  };

  return (
    <Paper elevation={0} sx={{ padding: "12px", borderRadius: "20px" }}>
      <Stack direction={{ xs: "column", sm: "row" }} spacing={3}>
        <div className="search">
          <input
            value={q}
            onChange={handleSearch}
            className="search__input"
            placeholder="Найти объявление...."
          />
          <button>
            <svg
              width="14"
              height="14"
              viewBox="0 0 14 14"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M5.43921 0.752075C6.6907 0.752075 7.8693 1.23927 8.75366 2.12512C9.63803 3.01105 10.1267 4.18646 10.1267 5.43958C10.1267 6.48643 9.78664 7.48197 9.15698 8.29602L13.2146 12.3536C13.2265 12.3655 13.2355 12.3801 13.2419 12.3956C13.2483 12.4111 13.2517 12.4277 13.2517 12.4445C13.2517 12.4612 13.2484 12.4778 13.2419 12.4933C13.2355 12.5088 13.2265 12.5234 13.2146 12.5353L12.533 13.215C12.5212 13.2267 12.5072 13.2359 12.4919 13.2423C12.4764 13.2488 12.459 13.2521 12.4421 13.2521C12.4255 13.252 12.4087 13.2487 12.3933 13.2423C12.378 13.2359 12.3641 13.2267 12.3523 13.215L8.2937 9.15833C7.47969 9.78632 6.48597 10.1271 5.43921 10.1271C4.18634 10.127 3.01001 9.63969 2.12573 8.75403C1.24136 7.86965 0.751709 6.69114 0.751709 5.43958C0.751715 4.18646 1.2398 3.00949 2.12573 2.12512C3.01 1.24104 4.18792 0.752143 5.43921 0.752075ZM5.43921 1.93958C4.50493 1.93964 3.62704 2.30409 2.9646 2.96497C2.30374 3.62588 1.93922 4.50526 1.93921 5.43958C1.93921 6.37388 2.30375 7.2517 2.9646 7.91418C3.62704 8.57506 4.50493 8.93951 5.43921 8.93958C6.37358 8.93958 7.25229 8.57512 7.91479 7.91418C8.5755 7.25329 8.93921 6.37378 8.93921 5.43958C8.9392 4.50537 8.57551 3.62742 7.91479 2.96497C7.25386 2.30247 6.37358 1.93958 5.43921 1.93958Z"
                fill="black"
                fill-opacity="0.85"
              />
            </svg>
          </button>
        </div>
        <Stack direction={"row"} spacing={2}>
          <div
            style={{
              display: "flex",
              backgroundColor: "#F4F4F6",
              alignItems: "center",
              padding: "2px 8px",
              gap: "10px",
              borderRadius: "8px",
              height: "32px",
            }}
          >
            <button
              onClick={handleByGrid}
              style={{
                padding: 0,
                margin: 0,
                background: "none",
                border: "none",
                width: "18px",
                height: "18px",
                cursor: "pointer",
              }}
            >
              <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M8.03587 1.60837H1.92873C1.75194 1.60837 1.6073 1.75301 1.6073 1.9298V8.03694C1.6073 8.21373 1.75194 8.35837 1.92873 8.35837H8.03587C8.21266 8.35837 8.3573 8.21373 8.3573 8.03694V1.9298C8.3573 1.75301 8.21266 1.60837 8.03587 1.60837ZM6.99123 6.9923H2.97337V2.97444H6.99123V6.9923ZM16.0716 1.60837H9.96444C9.78766 1.60837 9.64301 1.75301 9.64301 1.9298V8.03694C9.64301 8.21373 9.78766 8.35837 9.96444 8.35837H16.0716C16.2484 8.35837 16.393 8.21373 16.393 8.03694V1.9298C16.393 1.75301 16.2484 1.60837 16.0716 1.60837ZM15.0269 6.9923H11.0091V2.97444H15.0269V6.9923ZM8.03587 9.64408H1.92873C1.75194 9.64408 1.6073 9.78873 1.6073 9.96551V16.0727C1.6073 16.2494 1.75194 16.3941 1.92873 16.3941H8.03587C8.21266 16.3941 8.3573 16.2494 8.3573 16.0727V9.96551C8.3573 9.78873 8.21266 9.64408 8.03587 9.64408ZM6.99123 15.028H2.97337V11.0102H6.99123V15.028ZM16.0716 9.64408H9.96444C9.78766 9.64408 9.64301 9.78873 9.64301 9.96551V16.0727C9.64301 16.2494 9.78766 16.3941 9.96444 16.3941H16.0716C16.2484 16.3941 16.393 16.2494 16.393 16.0727V9.96551C16.393 9.78873 16.2484 9.64408 16.0716 9.64408ZM15.0269 15.028H11.0091V11.0102H15.0269V15.028Z"
                  fill={layout == "grid" ? "#1890FF" : "#000000D9"}
                />
              </svg>
            </button>
            <div
              style={{ width: "2px", backgroundColor: "white", height: "28px" }}
            ></div>
            <button
              style={{
                padding: 0,
                margin: 0,
                background: "none",
                border: "none",
                width: "18px",
                height: "18px",
                cursor: "pointer",
              }}
              onClick={handleByList}
            >
              <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M17.0363 2.57265H5.3042C5.21581 2.57265 5.14349 2.64498 5.14349 2.73337V3.85837C5.14349 3.94676 5.21581 4.01908 5.3042 4.01908H17.0363C17.1247 4.01908 17.1971 3.94676 17.1971 3.85837V2.73337C17.1971 2.64498 17.1247 2.57265 17.0363 2.57265ZM17.0363 8.27801H5.3042C5.21581 8.27801 5.14349 8.35033 5.14349 8.43873V9.56373C5.14349 9.65212 5.21581 9.72444 5.3042 9.72444H17.0363C17.1247 9.72444 17.1971 9.65212 17.1971 9.56373V8.43873C17.1971 8.35033 17.1247 8.27801 17.0363 8.27801ZM17.0363 13.9834H5.3042C5.21581 13.9834 5.14349 14.0557 5.14349 14.1441V15.2691C5.14349 15.3575 5.21581 15.4298 5.3042 15.4298H17.0363C17.1247 15.4298 17.1971 15.3575 17.1971 15.2691V14.1441C17.1971 14.0557 17.1247 13.9834 17.0363 13.9834ZM0.804199 3.29587C0.804199 3.44361 0.833298 3.5899 0.889835 3.72639C0.946371 3.86288 1.02924 3.9869 1.1337 4.09136C1.23817 4.19583 1.36219 4.2787 1.49868 4.33523C1.63517 4.39177 1.78146 4.42087 1.9292 4.42087C2.07694 4.42087 2.22323 4.39177 2.35972 4.33523C2.49621 4.2787 2.62023 4.19583 2.72469 4.09136C2.82916 3.9869 2.91203 3.86288 2.96856 3.72639C3.0251 3.5899 3.0542 3.44361 3.0542 3.29587C3.0542 3.14813 3.0251 3.00184 2.96856 2.86535C2.91203 2.72886 2.82916 2.60484 2.72469 2.50037C2.62023 2.39591 2.49621 2.31304 2.35972 2.2565C2.22323 2.19997 2.07694 2.17087 1.9292 2.17087C1.78146 2.17087 1.63517 2.19997 1.49868 2.2565C1.36219 2.31304 1.23817 2.39591 1.1337 2.50037C1.02924 2.60484 0.946371 2.72886 0.889835 2.86535C0.833298 3.00184 0.804199 3.14813 0.804199 3.29587V3.29587ZM0.804199 9.00123C0.804199 9.14896 0.833298 9.29525 0.889835 9.43175C0.946371 9.56824 1.02924 9.69225 1.1337 9.79672C1.23817 9.90119 1.36219 9.98405 1.49868 10.0406C1.63517 10.0971 1.78146 10.1262 1.9292 10.1262C2.07694 10.1262 2.22323 10.0971 2.35972 10.0406C2.49621 9.98405 2.62023 9.90119 2.72469 9.79672C2.82916 9.69225 2.91203 9.56824 2.96856 9.43175C3.0251 9.29525 3.0542 9.14896 3.0542 9.00123C3.0542 8.85349 3.0251 8.7072 2.96856 8.57071C2.91203 8.43422 2.82916 8.3102 2.72469 8.20573C2.62023 8.10126 2.49621 8.0184 2.35972 7.96186C2.22323 7.90532 2.07694 7.87623 1.9292 7.87623C1.78146 7.87623 1.63517 7.90532 1.49868 7.96186C1.36219 8.0184 1.23817 8.10126 1.1337 8.20573C1.02924 8.3102 0.946371 8.43422 0.889835 8.57071C0.833298 8.7072 0.804199 8.85349 0.804199 9.00123V9.00123ZM0.804199 14.7066C0.804199 14.8543 0.833298 15.0006 0.889835 15.1371C0.946371 15.2736 1.02924 15.3976 1.1337 15.5021C1.23817 15.6065 1.36219 15.6894 1.49868 15.7459C1.63517 15.8025 1.78146 15.8316 1.9292 15.8316C2.07694 15.8316 2.22323 15.8025 2.35972 15.7459C2.49621 15.6894 2.62023 15.6065 2.72469 15.5021C2.82916 15.3976 2.91203 15.2736 2.96856 15.1371C3.0251 15.0006 3.0542 14.8543 3.0542 14.7066C3.0542 14.5588 3.0251 14.4126 2.96856 14.2761C2.91203 14.1396 2.82916 14.0156 2.72469 13.9111C2.62023 13.8066 2.49621 13.7238 2.35972 13.6672C2.22323 13.6107 2.07694 13.5816 1.9292 13.5816C1.78146 13.5816 1.63517 13.6107 1.49868 13.6672C1.36219 13.7238 1.23817 13.8066 1.1337 13.9111C1.02924 14.0156 0.946371 14.1396 0.889835 14.2761C0.833298 14.4126 0.804199 14.5588 0.804199 14.7066V14.7066Z"
                  fill={layout == "list" ? "#1890FF" : "#000000D9"}
                  fillOpacity="0.85"
                />
              </svg>
            </button>
          </div>
          <FormControl
            size="small"
            sx={{ width: "240px", height: "32px" }}
            className="custom-select"
          >
            <Select
              style={{
                width: "240px",
                textAlign: "left",
                border: "4px solid #F4F4F6",
                height: "32px",
                borderRadius: "8px",
              }}
              placeholder="Сортировка"
              value={sortColumn + " " + sortDirection}
              options={[
                {
                  value: "createdAt desc",
                  label: "По новизне (сначала новые)",
                },
                {
                  value: "createdAt asc",
                  label: "По новизне (сначала старые)",
                },
                { value: "title desc", label: "По названию (А → Я)" },
                { value: "title asc", label: "По названию (Я → А)" },
                { value: "price desc", label: "По цене (сначала дешевле)" },
                { value: "price asc", label: "ППо цене (сначала дороже)" },
              ]}
              onChange={handleSort}
            />
            {/* <Select
              sx={{
                width: "240px",
                height: "32px",
                borderRadius: "8px",
                border: "4px solid #F4F4F6",
                outline: "none",
                fontSize: "14px",
              }}
              label="Сортировка"
              value={sortColumn + " " + sortDirection}
              onChange={handleSort}
            >
              <MenuItem value="createdAt desc">
                По новизне (сначала новые)
              </MenuItem>
              <MenuItem value="createdAt asc">
                По новизне (сначала старые)
              </MenuItem>
              <MenuItem value="title desc">По названию (А → Я)</MenuItem>
              <MenuItem value="title asc">По названию (Я → А)</MenuItem>
              <MenuItem value="price desc">По цене (сначала дешевле)</MenuItem>
              <MenuItem value="price asc">По цене (сначала дороже)</MenuItem>
            </Select> */}
          </FormControl>
        </Stack>

        {/* <FormControl size="small" fullWidth>
          <InputLabel>Направление</InputLabel>
          <Select
            label="Направление"
            value={sortDirection}
            onChange={handleSortDir}
          >
            <MenuItem value="desc">По убыванию</MenuItem>
            <MenuItem value="asc">По возрастанию</MenuItem>
          </Select>
        </FormControl> */}
        {/* </Stack>/ */}
      </Stack>
    </Paper>
  );
}
